Ran Plan for project: `prod` dir: `opentofu` workspace: `prod`

<details><summary>Show Output</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

OpenTofu will perform the following actions:

  # module.hetzner-vps.hcloud_server.server will be created
+ resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = true
      + datacenter                 = "fsn1-dc14"
      + delete_protection          = false
      + firewall_ids               = [
          + 2127713,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-12"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = (known after apply)
      + name                       = "postgres"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx22"
      + shutdown_before_deletion   = false
      + status                     = (known after apply)

      + public_net {
          + ipv4         = 89499765
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=opentoucan%252Finfrastructure-config%252Fopentofu%252Fprod)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```